<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 1, Part 2<br>Introduction to Core Concepts, ER Modeling, Relational Algebra, SQL<br>
    
</span>
</center></i>

# Introduction and Overview

## HW Objectives

- HW 1 part 1 covered general topics and knowledge from the class material. Part 2 has practical exercises.


- The notebook contains core practical exercises for both tracks (Programming, Non-Programming). All students complete this section.


- There are not track specific assignments for this HW.

## Submission Instructions

Complete all the tests in this notebook and submit only this notebook as a PDF to GradeScope. To convert the jupyter notebook into a pdf you can use either of the following methods:

- File --> Print Preview --> Print --> Save to PDF 

- File --> Download As HTML --> Print --> Save to PDF


__Due date: February 12, 11:59 PM EDT on GradeScope__



It is recommended that you put the screenshots into the same folder as this notebook so you do not have to alter the path to include your images. 


Please read all the instructions thoroughly!

## Guidelines

You may not work with or collaborate with anyone in any way to complete the homework. You may speak with the professor and TAs. You may ask __private__ questions on Ed if you need clarification.


You may use lecture slides, the textbook slides, the textbook or public information on the web to help you answer your questions. You may not "cut and past" information. Your answer must be in your own words and demonstrate the you understand the concept. If you use information for sources other than lectures, lecture slides, textbook slides or the textbook, you MUST provide a URL to the source you used.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [1]:
# Print your name, uni, and track below

name = "Donald F. Ferguson"
uni = "dff9"
track = "Cool Track"

print(name)
print(uni)
print(track)

Donald F. Ferguson
dff9
Cool Track

# Testing Environment

Run the following cells to ensure that your environment is set up.


You may need to change passwords.

## General Packages

In [2]:
import json

In [3]:
import csv

In [17]:
import pandas

In [23]:
import os

## pymysql

In [4]:
import pymysql

In [5]:
#
# Run this cell but change your user ID and password.
#
pymysql_conn = pymysql.connect(
    user="root",
    password="dbuserdbuser",
    host="localhost",
    port=3306,
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor
)

In [7]:
cursor = pymysql_conn.cursor()
sql = "show databases"
res = cursor.execute(sql)
databases = cursor.fetchall()

In [8]:
#
# Your list of databases will be different.
# You are fine as long as you do not get an error.
#
databases

[{'Database': 'class_example'},
 {'Database': 'classicmodels'},
 {'Database': 'db_book'},
 {'Database': 'f22_DB'},
 {'Database': 'f22_db_midterm'},
 {'Database': 'f22_e6156'},
 {'Database': 'f22_midterm'},
 {'Database': 'f22_project'},
 {'Database': 'F22_stats'},
 {'Database': 'graphql'},
 {'Database': 'hw4_recitation'},
 {'Database': 'information_schema'},
 {'Database': 'lahman_dump'},
 {'Database': 'lahmansbaseballdb'},
 {'Database': 'lahmansbaseballdb_demo'},
 {'Database': 'lahmansclean'},
 {'Database': 'lahmansdb2022'},
 {'Database': 'mysql'},
 {'Database': 'NewYorkGuardNew'},
 {'Database': 'NYGBackup'},
 {'Database': 'performance_schema'},
 {'Database': 's22_GoT'},
 {'Database': 's22_IMDB_clean'},
 {'Database': 'S22_IMDB_Raw'},
 {'Database': 'sys'},
 {'Database': 'W4111_Example'},
 {'Database': 'w4111_f22_hw4'},
 {'Database': 'W4111_HW1'}]

## ipython-SQL

In [1]:
%load_ext sql

In [2]:
#
# Remember to change your user ID and password.
#
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [3]:
%sql select * from db_book.student where ID=12345

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('12345', 'Shankar', 'Comp. Sci.', Decimal('32'))]

## SQLAlchemy

In [13]:
from sqlalchemy import create_engine

In [14]:
#
# Remember to change your user ID and password.
#
sql_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [15]:
engine = create_engine(sql_url)

In [18]:
sql = "select * from db_book.student"
df = pandas.read_sql(sql, con=engine)

In [19]:
df

       ID      name   dept_name  tot_cred
0   00128     Zhang  Comp. Sci.     102.0
1   12345   Shankar  Comp. Sci.      32.0
2   19991    Brandt     History      80.0
3   23121    Chavez     Finance     110.0
4   44553   Peltier     Physics      56.0
5   45678      Levy     Physics      46.0
6   54321  Williams  Comp. Sci.      54.0
7   55739   Sanchez       Music      38.0
8   70557      Snow     Physics       0.0
9   76543     Brown  Comp. Sci.      58.0
10  76653       Aoi  Elec. Eng.      60.0
11  98765  Bourikas  Elec. Eng.      98.0
12  98988    Tanaka     Biology     120.0

# Common Exercises

## Loading Data

- If you are running the notebook in the folder that you cloned/downloaded, there are files in the ```data``` directory.

In [20]:
!ls data

Appearances.csv                       course_feed.json
Batting.csv                           course_info.json
Managers.csv                          departments.csv
People.csv                            evalkit_eval_courses_instructors.json
Pitching.csv                          evalkit_eval_instructors.json
Teams.csv                             instructors.json
characters-groups.csv                 scenes.csv
characters.csv

In [21]:
data_dir = "data/"
csv_files = [
    "People.csv",
    "Appearances.csv",
    "Batting.csv",
    "Pitching.csv",
    "Teams.csv",
    "Managers.csv"
]

- Use ```%sql``` to create a databases schema ```lahmanshw1```.

In [22]:
#
# Answer
#
%sql create schema lahmanshw1

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

- The class lecture showed how to load a CSV file in Pandas and save to a database.


- Load and save the CSV files. You should implement the function and then call in the following cells.

In [27]:
def load_and_save_csv(data_dir:str, file_name:str, schema:str, table_name:str=None):
    """
    
    :param data_dir: The directory containing the file.
    :param file_name: The file name.
    :param schema: The database for the saved table.
    :param table_name: The name of the table to create. If the name is None, the function uses the name of
        the file before '.csv'. So, file_name 'cat.csv' becomes table 'cat'.
    :return: None
    """
    
    if table_name is None:
        table_name = file_name.split(".")
        table_name = table_name[0]
        
    full_file_name = os.path.join(data_dir, file_name)
    
    #
    # TODO: Remove answer and have your code goes here.
    #
    df = pandas.read_csv(full_file_name)
    df.to_sql(table_name, con=engine, schema=schema, if_exists='replace', index=False)

In [30]:
for f in csv_files:
    load_and_save_csv(data_dir, f, "lahmanshw1")
    print("Saved file:", f)

Saved file: People.csv
Saved file: Appearances.csv
Saved file: Batting.csv
Saved file: Pitching.csv
Saved file: Teams.csv
Saved file: Managers.csv

In [54]:
#
# The following should get the create table statements for the tables
# you created above.
#
# This code is here just because I was bored.
#
tables = %sql show tables from lahmanshw1
table_names = [t[0] for t in tables]
table_names

all_tables = ""

%sql use lahmanshw1

for t in table_names:
    sql = "show create table " + t
    tmp = %sql $sql 
    tmp = tmp[0][1]
    all_tables += "\n\n" + tmp

 * mysql+pymysql://root:***@localhost
6 rows affected.
 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

In [56]:
#
# If you want to see the schema printed as text, just uncomment the following and run.
#
#print(all_tables)

## Schema and Data Cleanup

- There is a section below for each of the tables you created/loaded. 


- There is a set of instructions in each section.


- You are going to "clean up" the tables, primarily focusing on keys.


- A conceptual ER diagram for the schema is:

| <img src="./lahmans-conceptual.png" width="700px"> |
| :---: |
| __Conceptual ER Diagram__ |

In [4]:
%sql use lahmansbaseballdb

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [5]:
%sql select * from managers limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('wrighha01', 1871, 'BS1', None, 1, 31, 20, 10, 3, 'Y'),
 ('woodji01', 1871, 'CH1', None, 1, 28, 19, 9, 2, 'Y'),
 ('paborch01', 1871, 'CL1', None, 1, 29, 10, 19, 8, 'Y'),
 ('lennobi01', 1871, 'FW1', None, 1, 14, 5, 9, 8, 'Y'),
 ('deaneha01', 1871, 'FW1', None, 2, 5, 2, 3, 8, 'Y'),
 ('fergubo01', 1871, 'NY2', None, 1, 33, 16, 17, 5, 'Y'),
 ('mcbridi01', 1871, 'PH1', None, 1, 28, 21, 7, 1, 'Y'),
 ('hastisc01', 1871, 'RC1', None, 1, 25, 4, 21, 9, 'Y'),
 ('pikeli01', 1871, 'TRO', None, 1, 4, 1, 3, 6, 'Y'),
 ('cravebi01', 1871, 'TRO', None, 2, 25, 12, 12, 6, 'Y')]

In [6]:
%sql select * from appearances limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1871, 'TRO', None, 'abercda01', 1, 1.0, 1, 1.0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'RC1', None, 'addybo01', 25, 25.0, 25, 25.0, 0, 0, 0, 22, 0, 3, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'CL1', None, 'allisar01', 29, 29.0, 29, 29.0, 0, 0, 0, 2, 0, 0, 0, 29, 0, 29, 0.0, 0.0, 0.0),
 (1871, 'WS3', None, 'allisdo01', 27, 27.0, 27, 27.0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'RC1', None, 'ansonca01', 25, 25.0, 25, 25.0, 0, 5, 1, 2, 20, 0, 1, 0, 0, 1, 0.0, 0.0, 0.0),
 (1871, 'FW1', None, 'armstbo01', 12, 12.0, 12, 12.0, 0, 0, 0, 0, 0, 0, 0, 11, 1, 12, 0.0, 0.0, 0.0),
 (1871, 'RC1', None, 'barkeal01', 1, 1.0, 1, 1.0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0.0, 0.0, 0.0),
 (1871, 'BS1', None, 'barnero01', 31, 31.0, 31, 31.0, 0, 0, 0, 16, 0, 15, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'FW1', None, 'barrebi01', 1, 1.0, 1, 1.0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0),
 (1871, 'BS1', None, 'barrofr01', 18, 17.0, 18, 18.0, 0, 0, 0, 1, 0, 0, 13, 0, 4, 17, 0.0, 0.0, 0.0)]

In [8]:
%sql select * from batting limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('abercda01', 1871, 1, 'TRO', None, 1, 4, 0, 0, 0, 0, 0, 0.0, 0.0, 0.0, 0, 0.0, None, None, None, None, 0.0),
 ('addybo01', 1871, 1, 'RC1', None, 25, 118, 30, 32, 6, 0, 0, 13.0, 8.0, 1.0, 4, 0.0, None, None, None, None, 0.0),
 ('allisar01', 1871, 1, 'CL1', None, 29, 137, 28, 40, 4, 5, 0, 19.0, 3.0, 1.0, 2, 5.0, None, None, None, None, 1.0),
 ('allisdo01', 1871, 1, 'WS3', None, 27, 133, 28, 44, 10, 2, 2, 27.0, 1.0, 1.0, 0, 2.0, None, None, None, None, 0.0),
 ('ansonca01', 1871, 1, 'RC1', None, 25, 120, 29, 39, 11, 3, 0, 16.0, 6.0, 2.0, 2, 1.0, None, None, None, None, 0.0),
 ('armstbo01', 1871, 1, 'FW1', None, 12, 49, 9, 11, 2, 1, 0, 5.0, 0.0, 1.0, 0, 1.0, None, None, None, None, 0.0),
 ('barkeal01', 1871, 1, 'RC1', None, 1, 4, 0, 1, 0, 0, 0, 2.0, 0.0, 0.0, 1, 0.0, None, None, None, None, 0.0),
 ('barnero01', 1871, 1, 'BS1', None, 31, 157, 66, 63, 10, 9, 0, 34.0, 11.0, 6.0, 13, 1.0, None, None, None, None, 1.0),
 ('barrebi01', 1871, 1, 'FW1', None, 1, 5, 1, 1, 1, 0, 0, 1.0, 0.0, 0.0, 0, 0.0, None, None, None, None, 0.0),
 ('barrofr01', 1871, 1, 'BS1', None, 18, 86, 13, 13, 2, 1, 0, 11.0, 1.0, 0.0, 0, 0.0, None, None, None, None, 0.0)]

### People

- The ```people``` table scheme is below.

```
create table People
(
    playerID     text   null,
    birthYear    double null,
    birthMonth   double null,
    birthDay     double null,
    birthCountry text   null,
    birthState   text   null,
    birthCity    text   null,
    deathYear    double null,
    deathMonth   double null,
    deathDay     double null,
    deathCountry text   null,
    deathState   text   null,
    deathCity    text   null,
    nameFirst    text   null,
    nameLast     text   null,
    nameGiven    text   null,
    weight       double null,
    height       double null,
    bats         text   null,
    throws       text   null,
    debut        text   null,
    finalGame    text   null,
    retroID      text   null,
    bbrefID      text   null
);
```

- You are to implement the following tasks:
    1. Determine reasonable lengths for ```text``` columns and convert the columns to ```varchar```.
    3. Convert the columns that are ```double``` to ```int```.
    2. Add columns ```dateOfBirth``` and ```dateOfDeath``` of type ```Date```. Set the values of the new columns based on the ```birthYear, birthMonth, birthDay, deathYear, deathMonth, deathDay``` column values.
    4. Change ```bats``` and ```throws``` to ```ENUM``` types.
    5. Convert the column type for ```debug``` and ```finalGame``` to date and set the values correctly.
    
    
- You implement the tasks changing the schema by executing ```ALTER TABLE``` statements.


- Changing or setting values usually requires you to execute ```UPDATE``` statements.


- You need to execute you statements in the cells below. You may add additional cells.

### Managers

- The schema for the managers table is

```
create table Managers
(
    playerID text   null,
    yearID   bigint null,
    teamID   text   null,
    lgID     text   null,
    inseason bigint null,
    G        bigint null,
    W        bigint null,
    L        bigint null,
    `rank`   bigint null,
    plyrMgr  text   null
);
```

- You are to implement the following tasks:
    - Convert ```playerID, teamID, lgID``` to ```varchar``` with reasonable sizes.
    - Convert ```yearID``` to ```char(4)```. I will explain why we are not using the data type ```Year```.
    - Convert ```plyrMgr``` to a ```BOOLEAN```. 
    
    
- Some of the tasks may require both ```ALTER TABLE``` and ```UPDATE```.

### Appearances

- The schema for the appearances table is

```
create table Appearances
(
    yearID    bigint null,
    teamID    text   null,
    lgID      text   null,
    playerID  text   null,
    G_all     bigint null,
    GS        double null,
    G_batting bigint null,
    G_defense double null,
    G_p       bigint null,
    G_c       bigint null,
    G_1b      bigint null,
    G_2b      bigint null,
    G_3b      bigint null,
    G_ss      bigint null,
    G_lf      bigint null,
    G_cf      bigint null,
    G_rf      bigint null,
    G_of      bigint null,
    G_dh      double null,
    G_ph      double null,
    G_pr      double null
);
```

- Do not worry about the columns that are numeric (```double, bigint```).


- Tasks:
    - Convert ```yearID``` to ```char(4)```
    - Convert the ```text``` columns to reasonably sized ```varchar```.

### Batting

- The Batting table is

```
create table Batting
(
    playerID text   null,
    yearID   bigint null,
    stint    bigint null,
    teamID   text   null,
    lgID     text   null,
    G        bigint null,
    AB       bigint null,
    R        bigint null,
    H        bigint null,
    `2B`     bigint null,
    `3B`     bigint null,
    HR       bigint null,
    RBI      double null,
    SB       double null,
    CS       double null,
    BB       bigint null,
    SO       double null,
    IBB      double null,
    HBP      double null,
    SH       double null,
    SF       double null,
    GIDP     double null
);
```

- You only need to fix the definitions ```playerID, teamID, yearID``` and ```lgID```.

### Pitching

- The Pitching table is:

```
create table Pitching
(
    playerID text   null,
    yearID   bigint null,
    stint    bigint null,
    teamID   text   null,
    lgID     text   null,
    W        bigint null,
    L        bigint null,
    G        bigint null,
    GS       bigint null,
    CG       bigint null,
    SHO      bigint null,
    SV       bigint null,
    IPouts   bigint null,
    H        bigint null,
    ER       bigint null,
    HR       bigint null,
    BB       bigint null,
    SO       bigint null,
    BAOpp    double null,
    ERA      double null,
    IBB      double null,
    WP       bigint null,
    HBP      double null,
    BK       bigint null,
    BFP      double null,
    GF       bigint null,
    R        bigint null,
    SH       double null,
    SF       double null,
    GIDP     double null
);
```

- You only need to fix the definitions ```playerID, teamID, yearID``` and ```lgID```.

### Teams

- The Teams table is:

```
create table Teams
(
    yearID         bigint null,
    lgID           text   null,
    teamID         text   null,
    franchID       text   null,
    divID          text   null,
    `Rank`         bigint null,
    G              bigint null,
    Ghome          double null,
    W              bigint null,
    L              bigint null,
    DivWin         text   null,
    WCWin          text   null,
    LgWin          text   null,
    WSWin          text   null,
    R              bigint null,
    AB             bigint null,
    H              bigint null,
    `2B`           bigint null,
    `3B`           bigint null,
    HR             bigint null,
    BB             double null,
    SO             double null,
    SB             double null,
    CS             double null,
    HBP            double null,
    SF             double null,
    RA             bigint null,
    ER             bigint null,
    ERA            double null,
    CG             bigint null,
    SHO            bigint null,
    SV             bigint null,
    IPouts         bigint null,
    HA             bigint null,
    HRA            bigint null,
    BBA            bigint null,
    SOA            bigint null,
    E              bigint null,
    DP             bigint null,
    FP             double null,
    name           text   null,
    park           text   null,
    attendance     double null,
    BPF            bigint null,
    PPF            bigint null,
    teamIDBR       text   null,
    teamIDlahman45 text   null,
    teamIDretro    text   null
);
```

- You need to make the following changes:
    - Convert ```yearID, teamID, lgID, franchID, divId``` to reasonable types.
    - Convert ```DivWin, WCWin, LGWin, WSWin``` to ```boolean```.

### Keys

#### Primary Keys

- In the following cells, write and SQL statements that demonstrates the combination of columns that is a valid primary key for each of the 6 tables.

- Write and execute SQL ```ALTER TABLE``` staments to add the primary keys to the tables.

- You will need to write queries that determine which columns form the foreign keys in the relationships. Write and execute your queries below.

- Write and execute the ```ALTER TABLE``` statements to create the foreign keys.


- __NOTE:__ There may be some minor issues with missing or incorrect data. You can delete a few rows if necessary.

## SQL Queries

### On-Base Percentage and Slugging

- Use the ```Batting``` table and ```People``` table.


- The formula for ```onBasePercentage``` is:
\begin{equation}
\frac{(H - 2b - 3b - HR) + 2 \times 2b + 3 \times 3b + 4 \times HR)}{AB}
\end{equation}


- Write a query that returns a table of the form
```
(playerID, nameLast, nameFirst, h, ab, G, onBasePercentage)
```

- Test your query with ```playerID``` ```willite01```.

### Players and Managers

- A person in ```People``` was a "player" if their ```playerID``` appears in ```Appearances.```


- A person in ```People``` was a "manager" if their ```playerID``` appears in ```Managers.```


- Write a query that returns a table of the form
```
(playerID, nameLast, nameFirst, career_player_games, career_manager_games)
```

- ```career_player_games``` is the sum of ```Appearances.G_all```. The value should be ```0``` if the person was never a player.


- ```career_manager_games``` is the sum of ```Managers.G```. The value should be ```0``` if the person was never a manager.


- Test your query with players born in California with ```nameLast``` "Williams."

In [9]:
%sql select playerid, sum(G_all) as career_player_games from appearances group by playerid limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('abercda01', Decimal('1')),
 ('addybo01', Decimal('274')),
 ('allisar01', Decimal('168')),
 ('allisdo01', Decimal('316')),
 ('ansonca01', Decimal('2524')),
 ('armstbo01', Decimal('12')),
 ('barkeal01', Decimal('1')),
 ('barnero01', Decimal('499')),
 ('barrebi01', Decimal('3')),
 ('barrofr01', Decimal('18'))]

In [10]:
%sql select playerid, sum(G) as career_manager_games from managers group by playerid limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('wrighha01', Decimal('2145')),
 ('woodji01', Decimal('206')),
 ('paborch01', Decimal('77')),
 ('lennobi01', Decimal('14')),
 ('deaneha01', Decimal('5')),
 ('fergubo01', Decimal('949')),
 ('mcbridi01', Decimal('252')),
 ('hastisc01', Decimal('45')),
 ('pikeli01', Decimal('71')),
 ('cravebi01', Decimal('195'))]

In [12]:
%%sql

with one as (
    select playerid, sum(G_all) as career_player_games from appearances group by playerid
),
two as (
    select playerid, sum(G) as career_manager_games from managers group by playerid
)
three as (
    select playerid, career_player_games, career_manager_games from one left join two using(playerid)
),
four as (
    select playerid, career_player_games, career_manager_games from one right join two using(playerid)
)

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('abercda01', Decimal('1'), None),
 ('addybo01', Decimal('274'), Decimal('31')),
 ('allisar01', Decimal('168'), None),
 ('allisdo01', Decimal('316'), Decimal('23')),
 ('ansonca01', Decimal('2524'), Decimal('2288')),
 ('armstbo01', Decimal('12'), None),
 ('barkeal01', Decimal('1'), None),
 ('barnero01', Decimal('499'), None),
 ('barrebi01', Decimal('3'), None),
 ('barrofr01', Decimal('18'), None)]